package basicCode;

public class RAM {
	/*
	 * 
	 * 
	 * 
	 * 
	 * 
	***RAM 구조
	*
	*
	===================== 높은 주소
	OS Kernel Space: 드라이버
	___________________________________ stack overflow!!
	Stack: 지역변수, 매개변수 (영역안에 같힌 변수)
	-----------------------------------
	Free
	-----------------------------------
	Heap: 동적메모리(new)
	___________________________________stack overflow!!
	BSS: 초기화되지 않은 변수
	___________________________________
	Data 영역: 전역변수, static변수
	____________________________________
	Text: 상수
	===================== 낮은 주소
	
	*
	*
	*
	*
	*
	*
	*/

}
